tests/OverviewStressTest.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  # http:
  #   timeout: 5
  phases:
    - duration: 1
      arrivalRate: 100
      # rampTo: 1
      name: Warm up phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  # ensure:
  #     thresholds:
  #       - http.response_time.p99: 100
  #       - http.response_time.p95: 75
scenarios:
  - flow:
    - log: "New virtual user running"
    - get:
        url: '/api/product'
    - get:
        url: '/api/images'