tests/OverviewStressTest.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  # http:
  #   timeout: 5
  phases:
<<<<<<< HEAD
    - duration: 15
      arrivalRate: 15
      # rampTo: 1
      name: Warm up phase
=======
    - duration: 60
      arrivalRate: 10
      name: Spiking Load
>>>>>>> f34f5cb51714fbca01a6311017abea81cf3b5310
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  # variables:
  #   id: "{{ $randomNumber(37311, 1037321) }}"
scenarios:
  - flow:
    - log: "New virtual user running"
    - get:
        url: '/api/product'
    - get:
        url: '/api/images'